In [1]:
import pandas as pd

In [213]:
s1 = pd.Series([12,34,56,78])

In [214]:
s2 = pd.Series(['sam', 'katlic', 'nemophee', 'abc'])

In [215]:
df = pd.DataFrame({'name' : s2, 'age' : s1})

In [216]:
df

       name  age
0       sam   12
1    katlic   34
2  nemophee   56
3       abc   78

In [9]:
def check(x):
    if x <40:
        return x**2
    else:
        return x

In [10]:
df['age'].apply(check)

0     144
1    1156
2      56
3      78
Name: age, dtype: int64

In [11]:
pd.isna(df)

    name    age
0  False  False
1  False  False
2  False  False
3  False  False

In [12]:
df3 = pd.DataFrame([{'a':1,'b':2},{'b':5, 'c' : 3}])

In [13]:
df3

     a  b    c
0  1.0  2  NaN
1  NaN  5  3.0

In [14]:
pd.isna(df3)

       a      b      c
0  False  False   True
1   True  False  False

In [17]:
nan_obj = pd.isna(df3['c'])

In [18]:
df3['c'][nan_obj]

0   NaN
Name: c, dtype: float64

In [19]:
df

       name  age
0       sam   12
1    katlic   34
2  nemophee   56
3       abc   78

In [106]:
df2 = pd.concat([df, pd.Series([22,44,55,66])], axis=1)

In [107]:
df2.columns = ['name', 'age', 'age']

In [108]:
df2

       name  age  age
0       sam   12   22
1    katlic   34   44
2  nemophee   56   55
3       abc   78   66

In [91]:
x = df2['age']

In [95]:
x =x[x['age']==55]

In [103]:
xx = pd.isna(x)

In [101]:
def check(x):
    if not x ==True:
        return x

In [104]:
xx

    age    age
2  True  False

In [102]:
xx.apply(check)

ValueError: ('The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().', 'occurred at index age')

In [71]:
def check(x):
    if not x == 55:
        return x

In [79]:
df2

       name  age  age
2  nemophee   56   55

In [89]:
df2.query("age==55", inplace=False)

       name  age  age
2  nemophee   56   55

In [109]:
df2

       name  age  age
0       sam   12   22
1    katlic   34   44
2  nemophee   56   55
3       abc   78   66

In [114]:
df2.iloc[2]

name    nemophee
age           56
age           55
Name: 2, dtype: object

In [115]:
from sklearn.datasets import load_iris

In [116]:
data = load_iris()

In [117]:
data

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'C:\\Users\\Katlic\\AppData\\Local\\Continuum\\anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\iris.csv'}

In [118]:
df = pd.DataFrame(data.data, columns = data.feature_names)

In [119]:
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [150]:
df.iloc[2,2]

1.3

In [141]:
avg = []
for i in range(150):
    sum = 0
    for j in range(4):
        sum = sum + df.iloc[i,j]
    val = sum/4
    avg.append(val)

In [151]:
len(avg)

150

In [154]:
df2 = pd.concat([df, pd.Series(avg)], axis=1)

In [144]:
df2

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),0
0,5.1,3.5,1.4,0.2,2.550
1,4.9,3.0,1.4,0.2,2.375
2,4.7,3.2,1.3,0.2,2.350
3,4.6,3.1,1.5,0.2,2.350
4,5.0,3.6,1.4,0.2,2.550
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,4.300
146,6.3,2.5,5.0,1.9,3.925
147,6.5,3.0,5.2,2.0,4.175
148,6.2,3.4,5.4,2.3,4.325
149,5.9,3.0,5.1,1.8,3.950

In [145]:
df2.to_csv('data.xlsx')

In [155]:
df2.columns = ['sepal len', 'sepal width', 'petal len', 'petal width', 'avg']

In [156]:
df2

     sepal len  sepal width  petal len  petal width    avg
0          5.1          3.5        1.4          0.2  2.550
1          4.9          3.0        1.4          0.2  2.375
2          4.7          3.2        1.3          0.2  2.350
3          4.6          3.1        1.5          0.2  2.350
4          5.0          3.6        1.4          0.2  2.550
..         ...          ...        ...          ...    ...
145        6.7          3.0        5.2          2.3  4.300
146        6.3          2.5        5.0          1.9  3.925
147        6.5          3.0        5.2          2.0  4.175
148        6.2          3.4        5.4          2.3  4.325
149        5.9          3.0        5.1          1.8  3.950

[150 rows x 5 columns]

In [148]:
df2.to_csv('data.csv')

In [153]:
df2.drop(['sepal len'], axis=1)

     sepal width  petal len  petal width    avg
0            3.5        1.4          0.2  2.550
1            3.0        1.4          0.2  2.375
2            3.2        1.3          0.2  2.350
3            3.1        1.5          0.2  2.350
4            3.6        1.4          0.2  2.550
..           ...        ...          ...    ...
145          3.0        5.2          2.3  4.300
146          2.5        5.0          1.9  3.925
147          3.0        5.2          2.0  4.175
148          3.4        5.4          2.3  4.325
149          3.0        5.1          1.8  3.950

[150 rows x 4 columns]

In [158]:
df2.rename(columns = {'avg' : 'mean value'})

     sepal len  sepal width  petal len  petal width  mean value
0          5.1          3.5        1.4          0.2       2.550
1          4.9          3.0        1.4          0.2       2.375
2          4.7          3.2        1.3          0.2       2.350
3          4.6          3.1        1.5          0.2       2.350
4          5.0          3.6        1.4          0.2       2.550
..         ...          ...        ...          ...         ...
145        6.7          3.0        5.2          2.3       4.300
146        6.3          2.5        5.0          1.9       3.925
147        6.5          3.0        5.2          2.0       4.175
148        6.2          3.4        5.4          2.3       4.325
149        5.9          3.0        5.1          1.8       3.950

[150 rows x 5 columns]

In [159]:
import numpy as np

In [171]:
s= pd.Series([1,2],dtype="int64")

In [172]:
pd.Series([num for num in range(10)])

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [173]:
s.append(np.random.randint(10))

TypeError: cannot concatenate object of type '<class 'int'>'; only Series and DataFrame objs are valid

In [174]:
s

0    1
1    2
dtype: int64

In [187]:
s = pd.Series(dtype="int64")

In [189]:
for i in range(5):
    s.at[i] = np.random.randint(10)

In [179]:
np.random.random_sample((4,))

array([0.78516041, 0.95660237, 0.40498519, 0.15885682])

In [180]:
df5 = pd.DataFrame()

In [181]:
for i in range(10):
    df5.iat[i] = pd.Series(np.random.random_sample((4,)))

ValueError: iAt based indexing can only have integer indexers

In [206]:
x = pd.Series([num for num in range(150)])

In [207]:
x

0        0
1        1
2        2
3        3
4        4
      ...
145    145
146    146
147    147
148    148
149    149
Length: 150, dtype: int64

In [208]:
aa = pd.DataFrame({'num' : x})

In [209]:
aa

     num
0      0
1      1
2      2
3      3
4      4
..   ...
145  145
146  146
147  147
148  148
149  149

[150 rows x 1 columns]

In [190]:
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [191]:
aa

   num
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9

In [195]:
x = pd.Panel({'item1' : df, 'items2' : aa})

C:\Users\Katlic\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  """Entry point for launching an IPython kernel.

TypeError: Panel() takes no arguments

In [196]:
pd.__version__

'0.25.1'

In [197]:
a = [df, aa]

In [201]:
a[0]

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [203]:
a[1]['num'][2]

2

In [204]:
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [210]:
aa

     num
0      0
1      1
2      2
3      3
4      4
..   ...
145  145
146  146
147  147
148  148
149  149

[150 rows x 1 columns]

In [212]:
pd.merge(df,aa, how="outer")

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [217]:
df

       name  age
0       sam   12
1    katlic   34
2  nemophee   56
3       abc   78

In [218]:
s = pd.Series([num for num in range(10,14)])

In [220]:
df2 = pd.DataFrame({'roll num ' : s})

In [221]:
df2

   roll num
0         10
1         11
2         12
3         13

In [223]:
pd.merge(df,df2, how="outer")

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [224]:
df

       name  age
0       sam   12
1    katlic   34
2  nemophee   56
3       abc   78

In [225]:
df2

   roll num
0         10
1         11
2         12
3         13

In [227]:
x1 = pd.DataFrame({'u_id':[1,2,3], "name":["Batman","Spiderman","IronMan"]})

x2 = pd.DataFrame({'u_id':[11,22,34,56],"age":[23,56,89,77]})

pd.merge(x1,x2, how="outer")

   u_id       name   age
0     1     Batman   NaN
1     2  Spiderman   NaN
2     3    IronMan   NaN
3    11        NaN  23.0
4    22        NaN  56.0
5    34        NaN  89.0
6    56        NaN  77.0

In [228]:
df

       name  age
0       sam   12
1    katlic   34
2  nemophee   56
3       abc   78

In [229]:
df2

   roll num
0         10
1         11
2         12
3         13

In [230]:
pd.merge(df, df2)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False